mischief/nlos/src/platform/esp32/lcd.c
/* the ST7789 panel, over IDF's esp_lcd: one driver, a pin map and a
 * geometry per board. Pin maps and offsets are from clm's esp32
 * firmware (board_config.h), the tested source for these boards.
 * A panel smaller than the ST7789's 240x320 RAM is a window inside it,
 * and wrong offsets draw a shifted, wrapped picture rather than fail.
 */

#include <sdkconfig.h>

/* Outside the board guard: the stubs at the bottom answer the same
 * declarations, so a board with no panel needs the header and the fixed
 * width types as much as one with a panel does.
 */
#include <stdint.h>

#include "lcd.h"

#if CONFIG_LUAOS_BOARD_CARDPUTER || CONFIG_LUAOS_BOARD_TDECK

#include <stdio.h>
#include <string.h>

#include <driver/gpio.h>
#include <driver/spi_master.h>
#include <freertos/FreeRTOS.h>
#include <freertos/semphr.h>
#include <freertos/task.h>
#include <esp_heap_caps.h>
#include <esp_lcd_panel_io.h>
#include <esp_lcd_panel_ops.h>
#include <esp_lcd_panel_vendor.h>

#include "kernel.h"
#include "platform.h"
#include "esp32.h"
#include "lcd.h"

#if CONFIG_LUAOS_BOARD_CARDPUTER

#define LCD_HOST	SPI3_HOST
#define LCD_W		240
#define LCD_H		135
#define LCD_SCK		36
#define LCD_MOSI	35
#define LCD_CS		37
#define LCD_DC		34
#define LCD_RST		33
#define LCD_BL		38
#define LCD_PCLK_HZ	(40 * 1000 * 1000)
#define LCD_GAP_X	40
#define LCD_GAP_Y	53

/* the Cardputer owns its bus: nothing else is on SPI3. */
#define LCD_BUS_SHARED	0

#else /* CONFIG_LUAOS_BOARD_TDECK */

/* A whole 320x240 panel, and no gap: the Cardputer's 240x135 is a
 * window onto a larger controller, which is what its offsets correct
 * for. This one uses the full frame, so the same driver needs none.
 */
#define LCD_HOST	TDECK_SPI_HOST
#define LCD_W		320
#define LCD_H		240
#define LCD_SCK		TDECK_SPI_SCK
#define LCD_MOSI	TDECK_SPI_MOSI
#define LCD_CS		TDECK_TFT_CS
#define LCD_DC		TDECK_TFT_DC

/* no reset line of its own: the panel is tied to the board reset, and
 * esp_lcd takes -1 to mean exactly that.
 */
#define LCD_RST		(-1)
#define LCD_BL		TDECK_TFT_BL
/* Above the vendor's 27MHz and clm's 40MHz, below the ST7789's ~62MHz
 * write ceiling. The shared bus is short here, and a faster pixel clock
 * is what makes a scroll's full-frame move quick. The SD sets its own
 * clock, so this does not touch it.
 */
#define LCD_PCLK_HZ	(60 * 1000 * 1000)
#define LCD_GAP_X	0
#define LCD_GAP_Y	0

/* the card and the radio share this bus, so tdeck.c owns it. */
#define LCD_BUS_SHARED	1

#endif

/* Staging bands of RGB565, in DMA-capable internal memory. Callers'
 * pixels are on the shared heap, which is not DMA-capable, so a copy is
 * needed whatever the size; this only sets how many transfers a large
 * rectangle costs.
 */

/* Several, so a caller fills the next while the panel takes the last.
 * Smaller and more beats one large, and internal SRAM is the scarce
 * pool here, so what matters is the product.
 */
#define BAND_ROWS	8
#define NBAND		3
#define BANDPX		(LCD_W * BAND_ROWS)

static esp_lcd_panel_handle_t panel;
static uint16_t *bands[NBAND];
static int bandi;

/* An optional copy of what was written, for unload(). The panel cannot
 * be read -- the ST7789's SDO is routed nowhere -- so a copy we kept is
 * the only honest answer.
 */

/* One bit a pixel: a screenshot shows shape, not colour, and ink is any
 * pixel that is not black. RGB565 would be 64800 bytes and kills a
 * board with no PSRAM, where 4050 is affordable.
 */
#define SHADOW_BYTES ((LCD_W * LCD_H + 7) / 8)
static unsigned char *shadow;

/* A full-color copy of the glass, in wire-order RGB565, for scrolling.
 *
 * The panel cannot be read and cannot scroll in hardware in this
 * orientation, so moving a line up means having the pixels to move. This
 * holds them: a scroll is a memmove here and one DMA of the moved band,
 * where a redraw renders every cell again. At 150KB it lives in PSRAM
 * and exists only where there is PSRAM -- the Cardputer redraws instead.
 */
static uint16_t *cshadow;
static int probed, present;

/* Raised when a transfer has finished. draw_bitmap queues and returns,
 * so the pixels belong to the DMA until this fires -- and `band` is one
 * buffer every caller reuses.
 */
static SemaphoreHandle_t sent;

/* completions the semaphore was too full to hold, and the most
 * transfers ever outstanding at once. The second may not exceed NBAND;
 * if it does, the first is how the machine stops.
 */
static volatile int refused;
static int peakinflight;
static int said;

static bool
transdone(esp_lcd_panel_io_handle_t io, esp_lcd_panel_io_event_data_t *ed,
    void *arg)
{
	BaseType_t woke = pdFALSE;

	(void)io;
	(void)ed;
	(void)arg;
	if (sent != NULL) {
		/* a give the semaphore cannot hold is a completion nobody
		 * will ever be told about, and drain would then wait for
		 * it forever. Counted rather than dropped in silence.
		 */
		if (xSemaphoreGiveFromISR(sent, &woke) != pdTRUE)
			refused++;
	}
	return woke == pdTRUE;
}

/* Queued and not yet reported done. A transfer that finished before we
 * came round again is a take that does not block, which is the point:
 * blocking costs a scheduler tick, many times a transfer.
 */
static int inflight;

/* wait for every outstanding transfer. Needed before a buffer that is
 * not one of ours is handed to the DMA, and before reading the panel.
 */
#define WAITMS 2000

/* one completion, or a report and a reset. This task is the scheduler,
 * so an unbounded wait here is the whole machine stopping: better to
 * say what the counts were and go on with them cleared, since a lost
 * give makes every later wait wrong by the same amount.
 */
static int
waitone(const char *who)
{
	char msg[128];

	if (xSemaphoreTake(sent, pdMS_TO_TICKS(WAITMS)) == pdTRUE)
		return 0;

	snprintf(msg, sizeof msg,
	    "lcd: %s: no completion in %dms, inflight=%d count=%d "
	    "refused=%d peak=%d", who, WAITMS, inflight,
	    (int)uxSemaphoreGetCount(sent), refused, peakinflight);
	kernel_log(msg);
	inflight = 0;
	return -1;
}

static void
drain(void)
{
	while (inflight > 0) {
		if (waitone("drain") != 0)
			return;
		inflight--;
	}
}

/* the next staging buffer to fill. Blocks only when every one of them
 * is still with the DMA.
 */
/* wait until another transfer may be queued. NBAND is the depth of
 * both the driver's queue and the completion semaphore, so going past
 * it means a give the semaphore cannot hold -- a completion nobody is
 * told about, and a later wait for it that never ends.
 */
static void
room(void)
{
	while (inflight >= NBAND) {
		if (waitone("room") != 0)
			break;
		inflight--;
	}
}

