mischief/nlos/src/platform/esp32/lcd.c
static uint16_t *
bandnext(void)
{
	uint16_t *b;

	/* the queue is served in order and these are handed out in
	 * order, so the one coming round again is the oldest: fewer
	 * outstanding than there are buffers means it has been sent.
	 */
	room();
	b = bands[bandi];
	bandi = (bandi + 1) % NBAND;
	return b;
}

/* queue one rectangle from a staging buffer and return. The pixels
 * belong to the DMA until a completion is counted, which bandnext does
 * before handing that buffer out again.
 */
static int
sendband(int x, int y, int w, int h, const uint16_t *px)
{
	/* every route in, so no caller can push the count past what the
	 * semaphore holds.
	 */
	room();
	if (esp_lcd_panel_draw_bitmap(panel, x, y, x + w, y + h,
	    (void *)px) != ESP_OK)
		return -1;
	inflight++;
	if (inflight > peakinflight)
		peakinflight = inflight;
	if (refused && !said) {
		char msg[96];

		said = 1;
		snprintf(msg, sizeof msg,
		    "lcd: a completion was refused: refused=%d peak=%d",
		    refused, peakinflight);
		kernel_log(msg);
	}
	return 0;
}

/* one rectangle from anywhere, and not back until the panel has it.
 * For a caller whose pixels this cannot keep -- a stack buffer, or the
 * shadow, which the next write would change underneath the DMA.
 */
static int
sendrect(int x, int y, int w, int h, const uint16_t *px)
{
	if (sendband(x, y, w, h, px) != 0)
		return -1;
	drain();
	return 0;
}

/* ST7789 wants big-endian RGB565 on the wire. Doing the swap here means
 * the rest of this file can think in ordinary host-order pixels.
 */
static inline uint16_t
rgb565(uint32_t rgb)
{
	uint16_t v = (uint16_t)(((rgb >> 8) & 0xf800) |
	    ((rgb >> 5) & 0x07e0) | ((rgb >> 3) & 0x001f));

	return (uint16_t)((v >> 8) | (v << 8));
}

int
luaos_lcd_present(void)
{
	spi_bus_config_t bus = {
		.mosi_io_num = LCD_MOSI,
		.miso_io_num = -1,
		.sclk_io_num = LCD_SCK,
		.quadwp_io_num = -1,
		.quadhd_io_num = -1,
		.max_transfer_sz = BANDPX * (int)sizeof(uint16_t),
	};
	/* one transfer outstanding, because there is one band buffer.
	 * draw_bitmap queues and returns, so the caller must not touch
	 * the pixels again until on_color_trans_done says they are gone.
	 */
	esp_lcd_panel_io_spi_config_t io_cfg = {
		.dc_gpio_num = LCD_DC,
		.cs_gpio_num = LCD_CS,
		.pclk_hz = LCD_PCLK_HZ,
		.lcd_cmd_bits = 8,
		.lcd_param_bits = 8,
		.spi_mode = 0,
		.trans_queue_depth = NBAND,
		.on_color_trans_done = transdone,
	};
	esp_lcd_panel_dev_config_t dev_cfg = {
		.reset_gpio_num = LCD_RST,
		/* RGB on both boards. The T-Deck's TFT_eSPI setup says
		 * TFT_BGR, but clm drives this panel through esp_lcd with
		 * RGB and works -- the two libraries do not mean the same
		 * thing by the flag, and the working code wins.
		 */
		.rgb_ele_order = LCD_RGB_ELEMENT_ORDER_RGB,
		.bits_per_pixel = 16,
	};
	gpio_config_t bl = {
		.pin_bit_mask = 1ULL << LCD_BL,
		.mode = GPIO_MODE_OUTPUT,
	};
	esp_lcd_panel_io_handle_t io = NULL;

	if (probed)
		return present;
	probed = 1;

	/* on a board where the bus is ours, set it up; where it is
	 * shared, tdeck.c has done it (or will have, for whichever
	 * driver probes first) and initialising it twice fails.
	 */
#if LCD_BUS_SHARED
	(void)bus;
	if (esp_tdeck_spi_init() != 0)
		return 0;
#else
	if (spi_bus_initialize(LCD_HOST, &bus, SPI_DMA_CH_AUTO) != ESP_OK)
		return 0;
#endif
	if (esp_lcd_new_panel_io_spi((esp_lcd_spi_bus_handle_t)LCD_HOST,
	    &io_cfg, &io) != ESP_OK)
		return 0;
	if (esp_lcd_new_panel_st7789(io, &dev_cfg, &panel) != ESP_OK)
		return 0;

	esp_lcd_panel_reset(panel);
	esp_lcd_panel_init(panel);
	/* inverted, and landscape: this panel is wired with its colours
	 * inverted and its axes swapped, so a driver that skips these
	 * shows a mirrored negative rather than nothing.
	 */
	esp_lcd_panel_invert_color(panel, true);
	/* native portrait to landscape. Both boards want the same
	 * transform; only the gap differs, because the Cardputer's panel
	 * is a window onto the same 240x320 controller.
	 */
	esp_lcd_panel_swap_xy(panel, true);
	esp_lcd_panel_mirror(panel, true, false);
	esp_lcd_panel_set_gap(panel, LCD_GAP_X, LCD_GAP_Y);
	esp_lcd_panel_disp_on_off(panel, true);

	for (int i = 0; i < NBAND; i++) {
		bands[i] = heap_caps_malloc(BANDPX * sizeof *bands[i],
		    MALLOC_CAP_DMA | MALLOC_CAP_INTERNAL);
		if (bands[i] == NULL)
			return 0;
	}
	/* counting, not binary: with several in flight the completions
	 * arrive before anyone waits, and a binary one would lose all
	 * but the last.
	 */
	sent = xSemaphoreCreateCounting(NBAND, 0);
	if (sent == NULL)
		return 0;

	/* and blank it before the backlight comes on. The controller's
	 * RAM holds whatever was there at power-on -- the last image of a
	 * previous firmware, or noise -- and lighting that is indis-
	 * tinguishable from a crash. Costs one full-screen fill at boot.
	 */
	{
		int y;

		for (y = 0; y < LCD_H; y += BAND_ROWS) {
			int n = (LCD_H - y < BAND_ROWS) ? LCD_H - y :
			    BAND_ROWS;

			uint16_t *b = bandnext();

			memset(b, 0, (size_t)LCD_W * n * sizeof *b);
			sendband(0, y, LCD_W, n, b);
		}
	}

	/* backlight last: a panel lit before it is initialised shows
	 * whatever was in RAM at power-on, which looks like a crash.
	 */
	gpio_config(&bl);
	gpio_set_level(LCD_BL, 1);

	present = 1;

#if CONFIG_LUAOS_FB_SHADOW
	/* a development build: keep what is written so unload works.
	 * Failing here is not fatal -- the panel is still usable, only
	 * unload is not.
	 */
	luaos_lcd_shadow(1);
#endif
	return 1;
}

int
luaos_lcd_shadow(int on)
{
	if (!present && on)
		return -1;
	if (on && shadow == NULL && cshadow == NULL) {
		/* Where there is PSRAM, keep a full-color copy and nothing
		 * else: it is the exact pixels the panel gets, so a
		 * screenshot is true color and a scroll has the pixels to
		 * move. Without PSRAM a color frame does not fit, so the
		 * fallback is one bit per pixel -- shape, not color -- in
		 * internal memory.
		 */
#if CONFIG_SPIRAM
		cshadow = heap_caps_malloc((size_t)LCD_W * LCD_H *
		    sizeof *cshadow, MALLOC_CAP_SPIRAM);
		if (cshadow != NULL) {
			memset(cshadow, 0, (size_t)LCD_W * LCD_H *
			    sizeof *cshadow);
			return 0;
		}
#endif
		shadow = heap_caps_malloc(SHADOW_BYTES,
		    MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT);
		if (shadow == NULL)
			return -1;
		memset(shadow, 0, SHADOW_BYTES);
	} else if (!on) {
		if (shadow != NULL) {
			heap_caps_free(shadow);
			shadow = NULL;
		}
		if (cshadow != NULL) {
			heap_caps_free(cshadow);
			cshadow = NULL;
		}
	}
	return 0;
}

