mischief/nlos/src/platform/esp32/lcd.c
/* is this colour ink, for the one-bit copy?
 *
 * Brightness rather than "not black". A program that draws on a dark
 * background rather than a black one -- bin/smiley.lua uses 0x101018 --
 * otherwise marks every pixel it touches, and the screenshot comes back
 * a solid block with the picture invisible inside it.
 *
 * Rec. 601 luma, halved to keep the arithmetic in a byte. The threshold
 * is low: this is asking "did something get drawn here", not matching a
 * palette.
 */
static int
shadow_ink(uint32_t rgb)
{
	uint32_t r = (rgb >> 16) & 0xff;
	uint32_t g = (rgb >> 8) & 0xff;
	uint32_t b = rgb & 0xff;

	return ((r * 77 + g * 151 + b * 28) >> 8) > 0x30;
}

static void
shadow_set(int x, int y, int ink)
{
	size_t bit = (size_t)y * LCD_W + x;

	if (ink)
		shadow[bit >> 3] |= (unsigned char)(1u << (bit & 7));
	else
		shadow[bit >> 3] &= (unsigned char)~(1u << (bit & 7));
}

/* white for ink, black for paper, as BGRx -- the layout load() takes.
 * Not the colours that were drawn: see the shadow's comment.
 *
 * bgrx picks which of the two layouts goes out. BGRx is the shared fb
 * protocol's, and every drawing client wants it. RGB is three bytes and
 * no pad, for a caller writing a file: the alternative is handing over
 * the pad so that lua can walk the rectangle a pixel at a time to take
 * it out again, which for a T-Deck screen measured 2.7 seconds -- while
 * the channels are already eight bits wide right here.
 */
static int
unload_px(int x, int y, int w, int h, unsigned char *out, int bgrx)
{
	const size_t bpp = bgrx ? 4 : 3;
	int row, col;

	if (!present)
		return -1;
	if (x < 0 || y < 0 || w <= 0 || h <= 0 ||
	    x + w > LCD_W || y + h > LCD_H)
		return -1;

	/* the color copy is the true one -- the exact pixels sent to the
	 * panel -- so where it exists a screenshot shows real colors, not
	 * the one-bit shape. RGB565 is stored wire-order (byte-swapped);
	 * undo that, then widen each channel to eight bits.
	 */
	if (cshadow != NULL) {
		for (row = 0; row < h; row++)
			for (col = 0; col < w; col++) {
				uint16_t cs = cshadow[(size_t)(y + row) *
				    LCD_W + x + col];
				uint16_t v = (uint16_t)((cs >> 8) | (cs << 8));
				unsigned r5 = (v >> 11) & 0x1f;
				unsigned g6 = (v >> 5) & 0x3f;
				unsigned b5 = v & 0x1f;
				unsigned char *px = out +
				    ((size_t)row * w + col) * bpp;
				unsigned char r =
				    (unsigned char)((r5 << 3) | (r5 >> 2));
				unsigned char g =
				    (unsigned char)((g6 << 2) | (g6 >> 4));
				unsigned char b =
				    (unsigned char)((b5 << 3) | (b5 >> 2));

				if (bgrx) {
					px[0] = b;
					px[1] = g;
					px[2] = r;
					px[3] = 0;
				} else {
					px[0] = r;
					px[1] = g;
					px[2] = b;
				}
			}
		return 0;
	}

	if (shadow == NULL)
		return -1;
	for (row = 0; row < h; row++)
		for (col = 0; col < w; col++) {
			size_t bit = (size_t)(y + row) * LCD_W + x + col;
			int ink = (shadow[bit >> 3] >> (bit & 7)) & 1;
			unsigned char *px = out + ((size_t)row * w + col) * bpp;
			unsigned char v = ink ? 0xff : 0x00;

			px[0] = v;
			px[1] = v;
			px[2] = v;
			if (bgrx)
				px[3] = 0;
		}
	return 0;
}

int
luaos_lcd_unload(int x, int y, int w, int h, unsigned char *out)
{
	return unload_px(x, y, w, h, out, 1);
}

int
luaos_lcd_unload_rgb(int x, int y, int w, int h, unsigned char *out)
{
	return unload_px(x, y, w, h, out, 0);
}

/* the shadow's own representation, handed over as-is.
 *
 * unload() expands one bit to four bytes because that is the shared fb
 * protocol's layout, and a caller that wants bits back then packs them
 * again in lua: 960 bytes of garbage per row to produce 30. For a
 * screen that is 130KB of churn on a machine with 61KB free, which is
 * what stopped a screenshot fitting alongside zmodem. This skips both
 * conversions.
 *
 * MSB first, which is PBM's bit order. Returns bytes written, or -1.
 */
int
luaos_lcd_unload1(int x, int y, int w, int h, unsigned char *out)
{
	int row, col, n = 0;

	if (!present || (shadow == NULL && cshadow == NULL))
		return -1;
	if (x < 0 || y < 0 || w <= 0 || h <= 0 ||
	    x + w > LCD_W || y + h > LCD_H)
		return -1;

	for (row = 0; row < h; row++) {
		unsigned char byte = 0;
		int nbit = 0;

		for (col = 0; col < w; col++) {
			size_t idx = (size_t)(y + row) * LCD_W + x + col;
			int ink;

			/* one bit derived from the color copy where there is
			 * one -- any non-black pixel is ink -- or read from
			 * the one-bit plane where that is all there is.
			 */
			if (cshadow != NULL)
				ink = cshadow[idx] != 0;
			else
				ink = (shadow[idx >> 3] >> (idx & 7)) & 1;
			byte = (unsigned char)(byte << 1) |
			    (unsigned char)ink;
			if (++nbit == 8) {
				out[n++] = byte;
				byte = 0;
				nbit = 0;
			}
		}
		if (nbit > 0)			/* pad the row to a byte */
			out[n++] = (unsigned char)(byte << (8 - nbit));
	}
	return n;
}

int
luaos_lcd_width(void)
{
	return LCD_W;
}

int
luaos_lcd_height(void)
{
	return LCD_H;
}

/* the cursor.
 *
 * plan 9's swcursor, minus the backing store. That exists to remember
 * what a cursor covered so it can be put back; cshadow already holds
 * every pixel the machine drew, so the repair reads from there and
 * there is nothing to keep in step.
 *
 * The invariant is one line: cshadow never contains the cursor. What is
 * on the glass is cshadow plus the cursor, and every path that writes
 * pixels writes cshadow first -- so erasing is a copy out of cshadow,
 * and a draw that lands under the cursor only has to put it back on
 * top afterwards.
 *
 * Without cshadow there is no cursor: the panel cannot be read, so
 * nothing could say what was underneath. A board with no PSRAM says no
 * rather than smearing.
 */
#define CURSOR_R	5			/* arms, so 11x11 */
#define CURSOR_SIDE	(2 * CURSOR_R + 1)
#define CURSOR_RGB	0x00ff00		/* green, over dark text */

static int curx = -1, cury = -1, curshown;

/* the cursor's rectangle, clipped to the screen. 0 if none of it is on
 * the glass, which is also what an unplaced cursor gives.
 */
static int
cursor_rect(int *x, int *y, int *w, int *h)
{
	int x0, y0, x1, y1;

	if (curx < 0 || cury < 0 || cshadow == NULL)
		return 0;
	x0 = curx - CURSOR_R;
	y0 = cury - CURSOR_R;
	x1 = curx + CURSOR_R + 1;
	y1 = cury + CURSOR_R + 1;
	if (x0 < 0)
		x0 = 0;
	if (y0 < 0)
		y0 = 0;
	if (x1 > LCD_W)
		x1 = LCD_W;
	if (y1 > LCD_H)
		y1 = LCD_H;
	if (x1 <= x0 || y1 <= y0)
		return 0;
	*x = x0;
	*y = y0;
	*w = x1 - x0;
	*h = y1 - y0;
	return 1;
}

