mischief/nlos/src/platform/esp32/lcd.c
/* paint the cursor's rectangle: the pixels underneath from cshadow,
 * with the crosshair drawn over them when `with` is set. One transfer
 * either way -- 242 bytes for an 11x11, against 10KB for a text band.
 */
static void
cursor_blit(int with)
{
	uint16_t buf[CURSOR_SIDE * CURSOR_SIDE];
	int x, y, w, h, r, c;

	if (!cursor_rect(&x, &y, &w, &h))
		return;

	for (r = 0; r < h; r++)
		for (c = 0; c < w; c++)
			buf[r * w + c] =
			    cshadow[(size_t)(y + r) * LCD_W + x + c];

	if (with) {
		uint16_t ink = rgb565(CURSOR_RGB);

		for (c = 0; c < w; c++)
			buf[(cury - y) * w + c] = ink;
		for (r = 0; r < h; r++)
			buf[r * w + (curx - x)] = ink;
	}
	sendrect(x, y, w, h, buf);
}

/* whether a rectangle just written overlaps the cursor, so the caller
 * knows to put it back. Asked after the write, since cshadow is already
 * current by then and the repair is just a paint.
 */
static int
cursor_hit(int x, int y, int w, int h)
{
	int cx, cy, cw, ch;

	if (!curshown || !cursor_rect(&cx, &cy, &cw, &ch))
		return 0;
	return !(x >= cx + cw || x + w <= cx || y >= cy + ch || y + h <= cy);
}

/* build the state a band loop plus a cursor blit leaves behind, and
 * report whether it loses a completion. `extra` is what follows the
 * band loop; a positive `settle` queues it raw and waits that many ms
 * with nobody taking, a negative one sends it the way cursor_blit
 * does. Returns the refusals caused, so 0 says the accounting held.
 */
int
luaos_lcd_spiprobe(int extra, int settle)
{
	int i;

	if (!present)
		return -1;

	drain();
	refused = 0;
	said = 0;

	for (i = 0; i < NBAND; i++) {
		uint16_t *b = bandnext();

		memset(b, 0, (size_t)LCD_W * sizeof *b);
		sendband(0, 0, LCD_W, 1, b);
	}
	for (i = 0; i < extra; i++) {
		if (settle < 0)
			sendrect(0, 0, LCD_W, 1, bands[0]);
		else
			sendband(0, 0, LCD_W, 1, bands[0]);
	}

	if (settle > 0)
		vTaskDelay(pdMS_TO_TICKS(settle));
	drain();
	return refused;
}

/* move the cursor, show it, or hide it.
 *
 * on < 0 leaves the visibility alone, which is what a move is.
 */
int
luaos_lcd_cursor(int x, int y, int on)
{
	if (!present || cshadow == NULL)
		return -1;

	if (curshown)
		cursor_blit(0);		/* erase from where it was */

	if (x >= 0)
		curx = x;
	if (y >= 0)
		cury = y;
	if (on >= 0)
		curshown = on != 0;

	if (curshown)
		cursor_blit(1);
	return 0;
}

int
luaos_lcd_fill(int x, int y, int w, int h, uint32_t rgb)
{
	uint16_t px = rgb565(rgb);
	int i, row;

	if (!present || w <= 0 || h <= 0 || w > LCD_W)
		return -1;

	if (shadow != NULL) {
		int r, c, ink = shadow_ink(rgb);

		for (r = 0; r < h; r++)
			for (c = 0; c < w; c++)
				shadow_set(x + c, y + r, ink);
	}
	if (cshadow != NULL) {
		int r, c;

		for (r = 0; r < h; r++)
			for (c = 0; c < w; c++)
				cshadow[(size_t)(y + r) * LCD_W + x + c] = px;
	}

	/* a buffer of its own per band, though they all hold the same
	 * pixels: one sent twice would be written again while the DMA
	 * still had it.
	 */
	for (row = 0; row < h; row += BAND_ROWS) {
		int n = (h - row < BAND_ROWS) ? h - row : BAND_ROWS;
		uint16_t *b = bandnext();

		for (i = 0; i < w * n; i++)
			b[i] = px;
		if (sendband(x, y + row, w, n, b) != 0)
			return -1;
	}
	if (cursor_hit(x, y, w, h))
		cursor_blit(1);
	return 0;
}

/* BGRx in, RGB565 out. The 4-byte layout is what efi's Blt uses and so
 * what fb.lua's clients already produce; converting here keeps every
 * caller platform-blind.
 */
int
luaos_lcd_load(int x, int y, int w, int h, const unsigned char *pix)
{
	int row;

	if (!present || w <= 0 || h <= 0 || w > LCD_W)
		return -1;

	for (row = 0; row < h; row += BAND_ROWS) {
		int n = (h - row < BAND_ROWS) ? h - row : BAND_ROWS;
		int i, count = w * n;
		const unsigned char *src = pix + (size_t)row * w * 4;
		uint16_t *band = bandnext();

		for (i = 0; i < count; i++) {
			uint32_t b = src[i * 4 + 0];
			uint32_t g = src[i * 4 + 1];
			uint32_t r = src[i * 4 + 2];

			band[i] = rgb565((r << 16) | (g << 8) | b);
			if (shadow != NULL)
				shadow_set(x + i % w, y + row + i / w,
				    shadow_ink((r << 16) | (g << 8) | b));
			if (cshadow != NULL)
				cshadow[(size_t)(y + row + i / w) * LCD_W +
				    x + i % w] = band[i];
		}
		if (sendband(x, y + row, w, n, band) != 0)
			return -1;
	}
	if (cursor_hit(x, y, w, h))
		cursor_blit(1);
	return 0;
}

/* The same, in the panel's own format and wire byte order, so this
 * copies where the four-byte path walks pixels. The band is copied at
 * all only because it must be DMA-capable and the caller's is not.
 */
int
luaos_lcd_load16(int x, int y, int w, int h, const unsigned char *pix)
{
	int row;

	if (!present || w <= 0 || h <= 0 || w > LCD_W)
		return -1;

	for (row = 0; row < h; row += BAND_ROWS) {
		int n = (h - row < BAND_ROWS) ? h - row : BAND_ROWS;
		const unsigned char *src = pix + (size_t)row * w * 2;
		uint16_t *band = bandnext();
		int i;

		memcpy(band, src, (size_t)w * n * 2);
		if (cshadow != NULL)
			for (i = 0; i < n; i++)
				memcpy(&cshadow[(size_t)(y + row + i) *
				    LCD_W + x], src + (size_t)i * w * 2,
				    (size_t)w * 2);
		/* the one-bit copy has no format to share: a board without
		 * PSRAM keeps shape, so this still asks per pixel.
		 */
		if (shadow != NULL)
			for (i = 0; i < w * n; i++)
				shadow_set(x + i % w, y + row + i / w,
				    (src[i * 2] | src[i * 2 + 1]) != 0);
		if (sendband(x, y + row, w, n, band) != 0)
			return -1;
	}
	if (cursor_hit(x, y, w, h))
		cursor_blit(1);
	return 0;
}

/* Move a full-width band of the glass up or down, using the color copy.
 *
 * The only move a console makes: x and tox zero, the whole width, h rows
 * from y to toy. The pixels come from cshadow, so no readback is needed
 * and no cell is rendered again -- a memmove and one DMA of the band
 * that moved, against a redraw of every row. Anything else, or no color
 * copy, returns -1 and the caller redraws.
 */
int
luaos_lcd_scroll(int x, int y, int tox, int toy, int w, int h)
{
	int row;

	(void)w;
	if (!present || cshadow == NULL)
		return -1;
	if (x != 0 || tox != 0 || h <= 0)
		return -1;
	if (y < 0 || toy < 0 || y + h > LCD_H || toy + h > LCD_H)
		return -1;

	memmove(cshadow + (size_t)toy * LCD_W, cshadow + (size_t)y * LCD_W,
	    (size_t)h * LCD_W * sizeof *cshadow);
	if (shadow != NULL) {
		size_t bpr = LCD_W / 8;

		memmove(shadow + (size_t)toy * bpr, shadow + (size_t)y * bpr,
		    (size_t)h * bpr);
	}
	/* DMA straight from the shadow rather than staging through band:
	 * the rows are already there and already in the panel's format.
	 */
	for (row = 0; row < h; row += BAND_ROWS) {
		int n = (h - row < BAND_ROWS) ? h - row : BAND_ROWS;

		if (sendrect(0, toy + row, LCD_W, n,
		    cshadow + (size_t)(toy + row) * LCD_W) != 0)
			return -1;
	}
	if (cursor_hit(0, toy, LCD_W, h))
		cursor_blit(1);
	return 0;
}

#else /* !CONFIG_LUAOS_BOARD_CARDPUTER */

int
luaos_lcd_present(void)
{
	return 0;
}

int
luaos_lcd_shadow(int on)
{
	(void)on;
	return -1;
}

int
luaos_lcd_unload(int x, int y, int w, int h, unsigned char *out)
{
	(void)x; (void)y; (void)w; (void)h; (void)out;
	return -1;
}

int
luaos_lcd_unload_rgb(int x, int y, int w, int h, unsigned char *out)
{
	(void)x; (void)y; (void)w; (void)h; (void)out;
	return -1;
}

int
luaos_lcd_unload1(int x, int y, int w, int h, unsigned char *out)
{
	(void)x; (void)y; (void)w; (void)h; (void)out;
	return -1;
}

int
luaos_lcd_width(void)
{
	return 0;
}

int
luaos_lcd_height(void)
{
	return 0;
}

int
luaos_lcd_fill(int x, int y, int w, int h, uint32_t rgb)
{
	(void)x; (void)y; (void)w; (void)h; (void)rgb;
	return -1;
}

int
luaos_lcd_load(int x, int y, int w, int h, const unsigned char *pix)
{
	(void)x; (void)y; (void)w; (void)h; (void)pix;
	return -1;
}

int
luaos_lcd_scroll(int x, int y, int tox, int toy, int w, int h)
{
	(void)x; (void)y; (void)tox; (void)toy; (void)w; (void)h;
	return -1;
}

int
luaos_lcd_cursor(int x, int y, int on)
{
	(void)x; (void)y; (void)on;
	return -1;
}

int
luaos_lcd_spiprobe(int extra, int settle)
{
	(void)extra; (void)settle;
	return -1;
}

#endif
